Autodesk.Revit.DB.Electrical.CableSize.GetCableSizes(Autodesk.Revit.DB.Document)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Electrical.CableSize.Duplicate
Duplicates this Cable Size.
Returns:
The duplicated Cable Size data.
Since:
2026

Autodesk.Revit.DB.Electrical.CableSize.GetCableSizeIdByName(Autodesk.Revit.DB.Document,System.String)
Gets the Cable Size id by given Cable Size name.
document:
The document.
name:
The Cable Size name.
Returns:
The Cable Size id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
name is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2026

Autodesk.Revit.DB.Electrical.CableSize.GetCableSizeIds(Autodesk.Revit.DB.Document)
Gets all the Cable Size ids in the given document, sorted by name.
document:
The document.
Returns:
All the Cable Size ids in this document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2026

Autodesk.Revit.DB.Electrical.CableSize.GetCableSize(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the Cable Size data by given Cable Size id.
document:
The document.
cableSizeId:
The Cable Size id.
Returns:
The Cable Size data.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2026

Autodesk.Revit.DB.Electrical.CableSize.Create(Autodesk.Revit.DB.Document)
Creates a Cable Size.
document:
The document.
Returns:
The newly created Cable Size data.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026

Autodesk.Revit.DB.Electrical.CableSize.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Electrical.CableSize.Name
The name of this Cable Size.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: name is an empty string or contains only whitespace.
-or-
When setting this property: name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
When setting this property: name is not unique in document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Electrical.CableSize.Id
The Cable Size id.
Since:
2026

Autodesk.Revit.DB.Electrical.CableSize.Comments
The comments of this Cable Size.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Electrical.CableSize.NumberOfOtherConductors
The number of Other Conductors.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for numberOfOtherConductors is negative.
Since:
2026

Autodesk.Revit.DB.Electrical.CableSize.OtherConductorSize
The size of an Other Conductor.
Remarks:
Each Other Conductor has the same size.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The id is not a Conductor Size id nor invalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Electrical.CableSize.NumberOfGroundConductors
The number of Ground Conductors.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for numberOfGroundConductors is negative.
Since:
2026

Autodesk.Revit.DB.Electrical.CableSize.GroundConductorSize
The size of a Ground Conductor.
Remarks:
Each Ground Conductor has the same size.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The id is not a Conductor Size id nor invalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Electrical.CableSize.NumberOfNeutralConductors
The number of Neutral Conductors.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for numberOfNeutralConductors is negative.
Since:
2026

Autodesk.Revit.DB.Electrical.CableSize.NeutralConductorSize
The size of a Neutral Conductor.
Remarks:
Each Neutral Conductor has the same size.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The id is not a Conductor Size id nor invalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Electrical.CableSize.NumberOfHotConductors
The number of Hot Conductors.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for numberOfHotConductors is negative.
Since:
2026

Autodesk.Revit.DB.Electrical.CableSize.HotConductorSize
The size of a Hot Conductor.
Remarks:
Each Hot Conductor has the same size.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The id is not a Conductor Size id nor invalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Electrical.CableSize
This class represents the definition of Cable Size data.
Since:
2026